# RbsElecPanelTotalestloadPowerParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelTotalestloadPowerParam Property
ParameterTypeId Class See Also
---
"Power Total Estimated Demand"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelTotalestloadPowerParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelTotalestloadPowerParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelTotalestloadPowerParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace